app/Controllers/Home.php

SELECT *
FROM `users`
ORDER BY `id` DESC
---
    public function show()
    {
        $Model = new UserModel();
        $data['users'] = $Model->orderBy('id', 'DESC')->findAll();

INSERT INTO `users` (`Name`, `Email`, `Phone`) VALUES ('Amit Bhor', 'amitbhor6@gmail.com', '8793343495')
---
    public function insert()
    {
        $Model = new UserModel();
        $data = [
            'Name' => $this->request->getVar('name'),
            'Email' => $this->request->getVar('email'),
            'Phone' => $this->request->getVar('phone')
        ];
        $Model->insert($data);

SELECT *
FROM `users`
WHERE `id` = '3'
 LIMIT 1
---
    public function singleUser($id = null)
    {
        $Model = new UserModel();
        $data["users"] = $Model->where('id', $id)->first();

DELETE FROM `users`
WHERE `id` = '3'
AND `id` IN ('3')
---
    public function delete($id = null)
    {
        $Model = new UserModel();
        $data['users'] = $Model->where('id', $id)->delete($id);